# 팀장이 되고서야 알게된 잘하는 개발자의 비밀

<aside>
💡 연사 : 당근 박미정님
</aside>

# 팀에 필요한 역량

- 개인이 아닌 팀에 모여야 하는 역량들 (개인 관점 x)

---

## 1. 태도로 바라보는 역량 : 시작하는 것 만으로도 의미가 있음

- 솔직함 : 불편함을 드러내기
- 공유 & 피드백 : 빠르게 공유하고 피드백 수용
- 꼼꼼함 : 한 걸음 더 생각하고 디에틸
- 지식 공유

## 2. 경험으로 바라보는 역량 : 시행 착오를 겪으며 경험해야 의미있는결과가 있음

- 협업
- 왜? - 일 하는 이유와 결과가 제품에 미치는 영향도 파악
- 득과 실 판단하고 결정
- 올바른 성장 : 맥목적 성장 x , 목적이 뚜렷한 성장 & 팀의 방향에 어긋나지 않은 성장
- 우선순위 : 쳐내야 할 일을 구분하여 쳐내는..!
- 주도성 : 필요한 일을 스스로 만들기
- 오너쉽 :  개발 이후를 추적하고 관리하기, 일을 시작했던 이유 (개선하고 싶다는 점이 진짜 개선 되었는지를 배포 이후에 알아보는..)
- 매니징 : 일과 사람을 관리하기 (자연스럽게 갖춰져야 할 역량)

# 가상의 팀 설정을 통한 가정

---

- 경력 3, 7, 10 년

### 팀의 역량

- 경력 3: 솔직함, 꼼꼼함,
    - 솔직함 : 모르는 불편함을 말하기, 내가 아는게 진짜인지 의구심이 드는 불편함인지 말하기, 팀의 일하는 방식이 불편함을 말하기 (더 잘 할 수 있는 방식은 없나 이야기)
        - 개인의 성장과 팀의 프로세스 & 문화 개선에 영향을 미침
    - 꼼꼼함 : 본인이 아는 것에 대해 의구심을 한 번 더 갖는 것, 알고있다고 생각하는 것에 빈틈이 없는지 한 번 더 생각
        - 소통 방식의 꼼꼼함 (ex. 어떤 액션으로 결론을 냈는지) - 구조화된 메시지, 장황하지 않은
        - 본인의 해결방법을 제시함으로써 더 나은 방향을 다른 팀원으로부터 조언을 얻고자 하는 것
    - 공유 & 피드백
        - 스스로를 의심하고 **팀을 믿기**
        - 문제 공유, 발견된 현상, 판단 사항 공유
            - 공유를 통해 팀원에게 도움을 요청하는게 핵심
        - 팀의 신뢰도 향상과 개인의성장에 영향을 미침
    - 지식 전파
        - 이것저것 재지않고 용기있게 공유
        - 팀의 전파 문화와 신뢰도 향상에 영향을 미침
- 경력 7년
    - 협업 : 네 일, 내 일이 아닌 같이 잘 할 수 있는 방향으로 협업
        - 문제 오류에 대해 원인 해소가 있어도 끝까지 해결하겠다는 태도
    - 왜?  & 트레이드오프 - 주도성
        - 팀에서 해결해야하는 문제 찾기
        - 그 문제를 해결하면 얻게되는 결과를 명확히 하고
        - 해결하는 과정 중 적절한 선택을 하기
        
        ---
        
        ### 개발 단계
        
        - 분석
            - 우리(팀)가 어떤 문제를 해결해야 하는지 정의, 문제를 해결하면 어떤 임팩트가 있는지 정의 가능
        - 설계, 구현, 테스트, 배포 (트레이드오프)
            - 적절한 해결책의 장점과 단점 체크
    - 올바르성장, 꼼꼼함
        - 트랜드를 따라가는 성장이 아닌, 팀이 겪고 있는 문제를 더 잘 해결하기 위한 학습과 성장
        - 꼼꼼함은 평생의 미덕, 7년이어도 빈틈이 없는건 아니기 때문
- 경력 10년
    - 주도성, 왜?, 우선순위, 오너쉽
        - 팀에서 해결하는 문제 찾기
        - 그 문제를 해결하면 얻게 되는 결과를 명확히 하고
        - 결과를 얻기 위해서 어떤 일들을 해야할지 계획하고
        - 문제가 정말 해결되었는지 배포 이후를 추적/ 관리
        
        ---
        
        - 분석
            - 해결행하는 문제를 일로 만드는 일
            - 문제 해결하면 어떤 임팩트가 있는지 정의
        - 설계,구현, 테스트,배포
            - 우선순위
            - 일을 어떻게 쪼개고, 어떤일을 먼저 하지?
        - 추적
            - 오너쉽
            - 문제가 정말 해결되었는지, 추적하고 관리하는 역량
            - 일정 기간이 지날 때마다 지표를 공유
    - 일의 범위 많아짐
    - 협업, 꼼꼼함
        - 팀 내, 팀 간 같이 잘할 수 있는 방향을 누구보다 고민
        - 꼼꼼함은 평생의 미덕

## 결론

---

- 팀이 필요로 하는 역량 중, 내가 잘하고 있는 걸 찾아서 더 잘해보기!
- 부족한 부분은 나보다 더 잘하는 사람에게 조언을 구하고 배워보기

# 큐엔에이

---

## 갈등 상황을 어떻게 해결?

---

- 문서에 충돌이 기록되게 함
- 적절한 시점에 개입하여 팀으로 끌어올려 팀의 문제로 만들어 해결

## 짧은 면접 시간에 어떻게 태도 관련해서 측정하는지?

---

- 꼼꼼함 ( 꼬리질문을 통해서 측정 )
    - 이 기술을 왜 썼나
        - 여러가지 선택지 중에 선택한게 어떻게 제품에 영향이 미치는지
